namespace HW_17
/* Описать сущность геметрическая фигура. Используйте инкапсуляцию, 
 * наследование,полиморфизм для описания, треугольника, четырехугольника, 
 * ромба и овала Создайте методы, вычисляющие периметр, площадь, радиус, если необходимо всех фигур.
 * Также напишите перегрузку операторов сравнения для выявления наибольшой фигуры по площадям, пеиметрам и т.д*/
{
    public class GeometricFiigure
    {

        public int numberOfCorners;
        public double perimeter;
        public double sqare;
        public double radius;

    }
}
